src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Реализация/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
   Товары = Элементы.Товары.ТекущиеДанные;
   ПересчитатьСумму(Товары);		
КонецПроцедуры

// Пересчитать сумму.
// 
// Параметры:
//  Товары - ДанныеФормыЭлементКоллекции - Товары
&НаКлиенте
Процедура ПересчитатьСумму(Товары)
	Если Товары <> Неопределено Тогда
		Товары.Сумма = Товары.Цена * Товары.Количество;
	КонецЕсли;
КонецПроцедуры
